# coding:utf-8

a = 1
b = 2
c = 3

# 加法
d = a + b + c
d += c
print(d)  # 9
print("-------------------------")

# 减法
d -= a
print(d)  # 8
print("-------------------------")

# 乘法
d *= b  # d = d * b
print(d)  # 16
print("-------------------------")

a /= b
print(a)

# 整除
a //= b
print(a)
print("-------------------------")

# 取余
c %= 3
print(c)
print("-------------------------")

# 幂运算
f = 10
f **= 2
print(f)
print("-------------------------")

# 列表扩展
list_01 = [1, 2, 3]
print(list_01 * 2)
print("-------------------------")

# 元组乘法
tuple_01 = (1, 2, 3)
print(tuple_01 * 2)
print(tuple_01)
print("-------------------------")

dict_01 = {'name': '张大鹏'}
gb = 1
b = gb * 1024 * 1024 * 1024
print(b)
print("-------------------------")
